<template lang="pug">
  .text

    center
      h1 Мы так же, как и вы, обожаем технику Apple
        br
        small и хорошо понимаем, как поломка устройства-помошника портит привычный ритм жизни

    img(src="~assets/img/bg_1.jpg", alt="")

    h2 Не только ремонт, но и апгрейт
    p Несмотря на все достоинства, техника от Apple тоже может выйти из строя. 
    p Неприятности случаются, но всё можно починить и даже улучшить. <strong>Увеличить память iPhone iPad, установить SSD на Mac</strong>, заменить экран, аккумулятор, корпус, камеру, микросхему, микросхему памяти (NAND-Flash), реболлинг модема, очистка ультразвуком, сложная BGA-пайка... — это всё к нам.

    h2 Заменим, починим, восстановим
    p У нас есть для этого всё необходимое — лаборатория, свой склад запчастей и профессиональное оборудование. Примерно 3/4 неисправностей устраняются <b>за 30 минут</b>. А если неисправность неочевидна и точное диагностика дефектов займёт время, можем предоставить аналогичное Apple-устройство.
    p <strong>Диагностика БЕСПЛАТНА!</strong>
    p Не устроит рассчёт стоимости ремонта — просто заберёте свой аппарат.
    
    h2 Клиенты — занятые люди
    p Мы стараемся выполнять свою работу не только быстро, но и качественно. С гарантией решать проблему. Но на выезде выполнить правильный и аккуратный ремонт затруднительно. Поэтому мы не практикуем выезд мастера. 
    p Если нет времени или возможности приехать к нам в мастерскую, можем организовать курьерскую доставку.

    h2 Все официально — договор и акт материальная ответственности
    p Наш сервисный центр предоставляет 60 дней гарантию на все выполненные работы и установленные комплектующие.
    p.NB Исключением в принятия на себя гарантийных обязательств являются только заранее оговорённые ремонты, связанные с реболлом NAND, прогревом микросхем, операции с риском расслоения текстолита. Такие случаи обязательно согласовываются непосредственно перед ремонтом. 
    p Для обращения по вопросам гарантийного обслуживания достаточно указать идентификатор заказа (номер заказа или телефонный номер заказчика на момент обращения)
    p Причиной отказа в бесплатном гарантийном ремонте могут быть только поломки, возникшие в результате эксплуатации с нарушением рекомендаций производителя или дефекты, не связанные с выполненными работами.

    hr
    .SS
      h3 MacBro всегда рад помочь
      p ИП Глазков И.С.
        br
        | ОГРНИП 317774600231511
        br
        | ИНН: 772397550155 <br>
        a(href="https://egrul.nalog.ru/") сведения о регистрации ФНС РФ
        br
        | г. Москва, Покровка 3/7, 2 этаж
        br
        | тел.: +7(495) 64-255-64
        br
        | режим работы: Пн-Пт с 10-20 часов
        br
        | Сб-Вс - выходной

    // h2 CRM для обработки заказов
    // p Мы используем ПО для управления заказами. Программный комплекс, который помогает нам вести учёт и поддерживать порядок в работе.

    // p Вы можете запрашивать из нашей системы данные по статусу исполнения заказа через форму «Статус заказа» на сайте.


    // .BG


    // h1 Доставка
    // p Мы используем несколько способов доставки. Если у вас есть другой вариант — предложите его нам.

    // .flex.delivery
    //   div
    //     h2 Своими силами
    //     p Это самый простой способ — вы привозите аппараты к нам в офис сами.
    //     h2 Курьером по Москве
    //     p Наши штатные курьеры привезут устройства в любую точку Москвы с минимальной задержкой.
    //     p <b>Стоимость</b>: бесплатно
    //   div
    //     h2 Траспортной компанией по России
    //     p Мы обычно пользуемся услугами компании КурьерСервисЭкспресс. <b> Стоимость </b> зависит от растояния и веса. Каждая доставка расчитывается отдельно. К примеру, доставка в Санкт-Петербург 5-ти Айфонов стоит ~450 ₽ и занимает 1-2 дня. Мы поможем подобрать оптимальную траспортную компанию для вашего города, основываясь на своем опыте.
    //     p По нашим правилам доставку оплачивает заказчик. Так как стоимость за услуги минимальная то и наценка за доставку отсутсвует. Цены одинаковы для любого региона страны и не зависят от транспортировки.



</template>

<script>

</script>

<style lang="styl">


.SS
  background url('~assets/img/logo_screen.png') 100% 100% no-repeat 
  //img(src="~assets/img/logo_screen.png", alt="")

.delivery
  margin 2em 0
  div
    width: 50%
  & > div
    padding-right: 3em

</style>
