<template lang="pug">
  div
    .flex_sb.intro
      div
        center
          //- svg(viewbox='0 0 128 128', height='128', width='128')
          //-   path(d='M118.667,93.913,c-2.985,6.653-4.421,9.626-8.267,15.519c-5.364,8.226-12.928,18.469-22.309,18.545c-8.327,0.09-10.474-5.457-21.778-5.389    c-11.304,0.06-13.661,5.494-22.002,5.411c-9.374-0.083-16.541-9.325-21.905-17.551C7.399,87.463,5.82,60.481,15.074,46.128,c6.583-10.191,16.967-16.151,26.723-16.151c9.928,0,16.174,5.479,24.396,5.479c7.975,0,12.83-5.494,24.314-5.494,c8.693,0,17.903,4.764,24.456,12.983C93.477,54.791,96.956,85.656,118.667,93.913z M81.799,20.78,C85.974,15.391,89.138,7.775,87.994,0c-6.823,0.474-14.798,4.839-19.451,10.529c-4.242,5.155-7.728,12.825-6.367,20.268,C69.635,31.031,77.333,26.56,81.799,20.78z', fill='#A5B7CB')


          img(src="~assets/img/Logo.svg", alt="MacBro")
          //h1.H1 MacBro <br>
            //small сервис-центр 

          br
          img(src="~assets/img/gadgets.png")
          h1 Ремонт <b> Apple устройств </b> <br>
            small Москва, ул. Покровка 3/7
            //- br
            //- | в сервисном центре «MacBro»

          p
            a.Tel(href="tel:+74956425564") &nbsp; +7 (495) 64-255-64
          button.btn(@click="showModal = true") Заказать курьера


      #iChatTel
        .screen
          .from.end Вы ремонтируете iPhone ?
          .to.end Да. И не только. Мы восстанавливаем любые разбитые и утопленные устройства Apple. Занимаемся сложной пайкой плат.
          .from.end А цены ?
          .to Прайс «Ремонт TOП-50» на сайте
          .to Если тяжёлый случай... Узнайте стоимость после диагностики. Это БЕСПЛАТНО!
          //Вообще... При сложном ремонте ваш аппарат может попасть к нам, даже если вы обратились куда-то ещё 😃.
          .to.end При сложном ремонте ваш аппарат может попасть к нам,  даже если вы обращались в другой сервис-центр 😃.


    hr
    .BG.flex
      .text
        h2 iPhone, MacBook, iMac, iPad, iPod снова как новый
        h3 Быстро, доступно, легко восстановим любое Apple-устройство
        p 
          b MacBro 
          | - сервисный центр с бесплатной диагностикой, курьерской службой, складом запчастей для быстрой замены, оборудованием для BGA-пайки, опытными инженерами... Всё это, и ещё немного больше 
          //чтобы стать вашим Bro в ремонте Mac.
        // сложная BGA-пайка своим складом запчастей для быстрой замены, 
        nuxt-link.link(to="/about", style="float: right;") » Подробнее
        // ремонт по согласованной цене, держим запчасти для быстрой замены, гарантия
        // корпуса, экраны, АКБ, камеры, шлейфы, bluetooth/гироскоп/GPS/Wi-Fi-модули

      
      //- table.tbl_simple
      //-   tr
      //-     td iPhone 5C 16Gb
      //-     td iPhone 5C 32Gb
      //-     td до 4500 руб.
      //-   tr
      //-     td iPhone 5S 16Gb
      //-     td iPhone 5S 64Gb
      //-     td до 4500 руб.
      //-   tr
      //-     td iPhone 6 16Gb
      //-     td iPhone 6 128Gb
      //-     td до 6500 руб.
    //img(src="~assets/img/bg_3.jpg", width="60%", alt="")
    //hr

    #prices
      center
        h1 Стоимость ремонта iPhone
          br
          small Прайс «Ремонт TOП-50»
        
      ul.ulPrice_items
        li.link.circle(v-for="val, i in iPhones", :class="{ active: i === active }", @click="jump(i)") iPhone {{val}}
        
      .Table
        center
          .label iPhone {{ iPhones[active] }}
          h2 iPhone <b>{{ iPhones[active] }}</b> - Основное и корпус
          p
            i(v-for="val, i in iPhones", :class="{ active: i === active }", @click="jump(i)") {{val}}
        dl.flex_wr
          dt Замена LCD
          dd {{ Price['Замена LCD'][active] }} ₽
          dt Замена АКБ
          dd {{ Price['Замена АКБ'][active] }} ₽
          dt Чистка от пыли и грязи
          dd {{ Price['Чистка от пыли и грязи'][active] }} ₽
          dt Чистка ультразвуком после воды
          dd {{ Price['Чистка ультразвуком после воды'][active] }} ₽
          dt Ремонт после воды
          dd {{ Price['Ремонт после воды'][active] }} ₽
          dt Прошивка
          dd {{ Price['Прошивка'][active] }} ₽
          dt Получение данных из резервной копии
          dd {{ Price['Получение данных из резервной копии'][active] }} ₽
          dt Наклейка защитной пленки
          dd {{ Price['Наклейка защитной пленки'][active] }} ₽
          dt Наклейка защитного бронестекла
          dd {{ Price['Наклейка защитного бронестекла'][active] }} ₽
          dt Установка отсутсвующего болта (1 шт.)
          dd {{ Price['Установка отсутсвующего болта (1 шт.)'][active] }} ₽
          dt Замена задней крышки
          dd {{ Price['Замена задней крышки'][active] }} ₽
        
      .Table
        center
          .label IPhone {{ iPhones[active] }}
          h2 IPhone <b>{{ iPhones[active] }}</b> - Кнопки, разъёмы
          p
            i(v-for="val, i in iPhones", :class="{ active: i === active }", @click="jump(i)") {{val}}
        dl.flex_wr
          dt Ремонт кнопки включения
          dd {{ Price['Ремонт кнопки включения'][active] }} ₽
          dt Ремонт кнопок громкости
          dd {{ Price['Ремонт кнопок громкости'][active] }} ₽
          dt Ремонт кнопки вибро
          dd {{ Price['Ремонт кнопки вибро'][active] }} ₽
          dt Ремонт кнопки Home
          dd {{ Price['Ремонт кнопки Home'][active] }} ₽
          dt Замена кнопки Home (внешняя часть)
          dd {{ Price['Замена кнопки Home (внешняя часть)'][active] }} ₽
          dt Замена любой боковой кнопки (внешняя часть)
          dd {{ Price['Замена любой боковой кнопки (внешняя часть)'][active] }} ₽

          dt Замена разъема зарядки
          dd {{ Price['Замена разъема зарядки'][active] }}
          dt Замена разъема наушников
          dd {{ Price['Замена разъема наушников'][active] }}
          dt Замена разъема SIM-карты
          dd {{ Price['Замена разъема SIM-карты'][active] }}


      .Table
        center
          .label IPhone {{ iPhones[active] }}
          h2 IPhone <b>{{ iPhones[active] }}</b> - Шлейфы и антены
          p
            i(v-for="val, i in iPhones", :class="{ active: i === active }", @click="jump(i)") {{val}}
        dl.flex_wr
          dt Замена шлейфа кнопки Home
          dd {{ Price['Замена шлейфа кнопки Home'][active] }}
          dt Замена нижнего шлейфа
          dd {{ Price['Замена нижнего шлейфа'][active] }}
          dt Замена шлейфа кнопок громкости
          dd {{ Price['Замена шлейфа кнопок громкости'][active] }}
          dt Замена шлейфа кнопки включения
          dd {{ Price['Замена шлейфа кнопки включения'][active] }}
          dt Замена шлейфа передней камеры и датчика приближения
          dd {{ Price['Замена шлейфа передней камеры и датчика приближения'][active] }}
          dt Замена антены GSM
          dd {{ Price['Замена антены GSM'][active] }}
          dt Замена антены Wi-Fi
          dd {{ Price['Замена антены Wi-Fi'][active] }}
          dt Замена межплатного шлейфа кнопки home
          dd {{ Price['Замена межплатного шлейфа кнопки home'][active] }}


      .Table
        center
          .label IPhone {{ iPhones[active] }}
          h2 IPhone <b>{{ iPhones[active] }}</b> - Камера, звук
          p
            i(v-for="val, i in iPhones", :class="{ active: i === active }", @click="jump(i)") {{val}}
        dl.flex_wr
          dt Замена задней камеры
          dd {{ Price['Замена задней камеры'][active] }}
          dt Замена передней камеры
          dd {{ Price['Замена передней камеры'][active] }}
          dt Замена верхнего динамика
          dd {{ Price['Замена верхнего динамика'][active] }}
          dt Замена нижнего динамика
          dd {{ Price['Замена нижнего динамика'][active] }}
          dt Замена заднего верхнего микрофона
          dd {{ Price['Замена заднего верхнего микрофона'][active] }}
          dt Замена переднего верхнего микрофона
          dd {{ Price['Замена переднего верхнего микрофона'][active] }}
          dt Замена нижнего микрофона
          dd {{ Price['Замена нижнего микрофона'][active] }}
          dt Замена вибромотора
          dd {{ Price['Замена вибромотора'][active] }}

      .Table
        center
          .label IPhone {{ iPhones[active] }}
          h2 IPhone <b>{{ iPhones[active] }}</b> - Сложное
          p
            i(v-for="val, i in iPhones", :class="{ active: i === active }", @click="jump(i)") {{val}}
        dl.flex_wr      
          dt Пайка сетевой части
          dd {{ Price['Пайка сетевой части'][active] }} ₽
          dt Пайка разъемов
          dd {{ Price['Пайка разъемов'][active] }} ₽
          dt Пайка цепи камеры
          dd {{ Price['Пайка цепи камеры'][active] }} ₽
          dt Замена микросхемы управления зарядкой (tristar)
          dd {{ Price['Замена микросхемы управления зарядкой (tristar)'][active] }} ₽
          dt Замена микросхемы питания
          dd {{ Price['Замена микросхемы питания'][active] }} ₽
          dt Замена микросхемы Wi-Fi
          dd {{ Price['Замена микросхемы Wi-Fi'][active] }} ₽
          dt Замена микросхемы управления голосом
          dd {{ Price['Замена микросхемы управления голосом'][active] }} ₽
          dt Замена аудиокодека
          dd {{ Price['Замена аудиокодека'][active] }} ₽
          dt Замена микросхемы управления тачскрином
          dd {{ Price['Замена микросхемы управления тачскрином'][active] }} ₽
          dt Замена микросхемы питания дисплея
          dd {{ Price['Замена микросхемы питания дисплея'][active] }} ₽
          dt Замена микросхемы подсветки дисплея
          dd {{ Price['Замена микросхемы подсветки дисплея'][active] }} ₽
          dt Замена гироскопа/акселлерометра/компаса
          dd {{ Price['Замена гироскопа/акселлерометра/компаса'][active] }} ₽
          dt Замена усилителя нижнего динамика
          dd {{ Price['Замена усилителя нижнего динамика'][active] }} ₽
          dt Замена трансивера
          dd {{ Price['Замена трансивера'][active] }} ₽
          dt Замена микросхемы вспышки
          dd {{ Price['Замена микросхемы вспышки'][active] }} ₽
          dt Замена усилителей GSM
          dd {{ Price['Замена усилителей GSM'][active] }} ₽
          dt Замена микросхемы питания модемной части
          dd {{ Price['Замена микросхемы питания модемной части'][active] }} ₽
          dt Реболлинг модемного процессора
          dd {{ Price['Реболлинг модемного процессора'][active] }} ₽  
          dt Реболлинг NAND Flash
          dd {{ Price['Реболлинг NAND Flash'][active] }} ₽
          dt Замена микросхемы питания Touch ID
          dd {{ Price['Замена микросхемы питания Touch ID'][active] }} ₽


    //<Logo/>
    Modal(v-if="showModal", size="toCenter SM", @close="showModal = false")
      form
        center
          h2 Записаться на ремонт <br>
            small с курьерской доставкой
        input(type="text", placeholder="Номер телефона *")
        textarea(placeholder="Сообщение")
        button.btn Отправить

</template>

<script>

import Modal from '~/components/Modal.vue';


const iPhones = ["4","4S","5","5C","5S","6","6 Plus","6S","6S Plus","SE","7","7 Plus"],
    
Price = {
  "Замена LCD": ["1,790","1,790","2,790","2,790","2,790","3,990","5,490","6,490","7,490","2,790","8,490","9,990"],
  "Замена АКБ": ["1,590","1,590","1,690","1,690","1,690","1,990","2,190","2,190","2,290","1,690","2,490","2,690"],
  "Чистка от пыли и грязи": ["490","490","490","490","490","1490","1490","990","990","990","990","990"],
  "Чистка ультразвуком после воды": ["1,490","1,490","1,490","1,490","1,490","1,490","1,490","1,990","1,990","1,990","2,490","2,490"],
  "Ремонт после воды": ["от 490","от 490","от 490","от 490","от 490","от 990","от 990","от 990","от 990","от 990	","от 990	","от 990"],
  "Прошивка": ["890","890","890","890","890","890","890","890","890","890","890","890"],
  "Получение данных из резервной копии": ["1,990","1,990","1,990","1,990","1,990","1,490","1,490","1,990","1,990","1,990","1,990","1,990"],
  "Наклейка защитной пленки": ["200","200","400","400","400","500","600","500","600","400","500","600"],
  "Наклейка защитного бронестекла": ["400","400","500","500","500","700","800","700","800","500","700","800"],
  "Установка отсутсвующего болта (1 шт.)" : ["100","100","100","100","100","100","100","100","100","100","400","400"],
  "Замена задней крышки": ["590","590","3,490","3,490","3,490","3,690","3,990","6,490","7,990","3,990","8,990","9,990"],
  //КНОПКИ
  "Ремонт кнопки включения":["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,290","1,490","4,090","4,690"],
  "Ремонт кнопок громкости": ["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,290","1,490","4,090","4,690"],
  "Ремонт кнопки вибро": ["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,290","1,490","4,090","4,690"],
  "Ремонт кнопки Home": ["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,290","1,490","-","-"],
  "Замена кнопки Home (внешняя часть)": ["290","290","290","290","-","-","-","-","-","-","-","-"],
  "Замена любой боковой кнопки (внешняя часть)": ["290","290","290","290","290","290","290","290","290","290","290","290"],
  //РАЗЪЕМЫ
  "Замена разъема зарядки": ["1,390","1,390","1,490","1,490","1,490","2,190","2,690","2,890","3,290","1,890","2,890","4,690"],
  "Замена разъема наушников": ["1,390","1,390","1,490","1,490","1,490","2,190","2,690","2,890","3,290","1,890","-","-"],
  "Замена разъема SIM-карты": ["1,09","1,09","1,69","1,69","1,69","2,29","2,29","2,29","2,29","1,69","2,89","2,89"],
  //КАМЕРЫ
  "Замена задней камеры": ["1,590","1,590","1,590","1,590","1,590","2,790","3,090","5,190","5,790","2,590","5,890","6,490"],
  "Замена передней камеры": ["990","990","1,490","1,490","1,490","2,690","2,890","3,090","3,490","1,990","4,090","4,690"],
  //ЗВУК
  "Замена верхнего динамика": ["1,390","1,390","1,390","1,490","1,490","1,990","1,990","2,290","2,790","1,490","2,690","3,090"],
  "Замена нижнего динамика": ["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,090","1,490","3,290","3,490"],
  "Замена заднего верхнего микрофона": ["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,290","1,490","-","-"],
  "Замена переднего верхнего микрофона": ["-","-","1,490","1,490","1,490","2,690","2,890","3,090","3,490","1,490","4,090","4,690"],
  "Замена нижнего микрофона": ["1,390","1,390","1,490","1,490","1,490","2,190","2,690","2,890","3,290","1,890","4,090","4,690"],
  "Замена вибромотора": ["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,090","1,490","4,090","4,690"],
  //ШЛЕЙФЫ И АНТЕННЫ
  "Замена шлейфа кнопки Home": ["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,290","1,490","?","?"],
  "Замена нижнего шлейфа": ["1,390","1,390","1,490","1,490","1,490","2,190","2,690","2,890","3,290","1,890","4,090","4,690"],
  "Замена шлейфа кнопок громкости": ["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,290","1,490","4,090","4,690"],
  "Замена шлейфа кнопки включения": ["1,390","1,390","1,490","1,490","1,490","2,190","2,190","2,890","3,290","1,490","4,090","4,690"],
  "Замена шлейфа передней камеры и датчика приближения": ["990","990","1,490","1,490","1,490","2,690","2,890","3,090","3,490","1,990","4,090","4,690"],
  "Замена антены GSM": ["1,390","1,390","1,390","1,390","1,390","1,990","2,090","2,790","3,090","1,390","4,090","3,290"],
  "Замена антены Wi-Fi": ["1,390","1,390","1,390","1,390","1,390","2,190","2,190","2,890","3,190","1,390","3,190","3,390"],
  "Замена межплатного шлейфа кнопки home": ["-","-","-","-","-","2,190","2,190","-","-","-","-","-"],
  //ПАЙКА
  "Пайка сетевой части": ["3,490","4,000","4,000","4,000","4,000","5,000","5,000","7,000","7,000","4,000","8,000","8,000"],
  "Пайка разъемов": ["500 - 2 000","500 - 2 000","500 - 2 000","500 - 2 000","500 - 2 000","500 - 2 000","500 - 2 000","500 - 2 000","500 - 2 000","500 - 2 000","500 - 2 000","500 - 2 000"],
  "Пайка цепи камеры": ["2,000","3,000","3 000 - 4 000","3 000 - 4 000","3 000 - 4 000","3 500 - 4 500","3 500 - 4 500","4 500 - 5 500","4 500 - 5 500","3 500 - 4 500","5 000 - 6 000","5 000 - 6 000"],
  "Замена микросхемы управления зарядкой (tristar)": ["-","-","3,500","3,500","3,500","4,500","4,500","6,000","6,000","6,000","6,500","6,500"],
  "Замена микросхемы питания": ["3,500","3,500","4,500","4,500","4,500","5,000","5,000","6,000","6,000","5,000","7,000","7,000"],
  "Замена микросхемы Wi-Fi": ["4,000","3,500","4,000","4,500","4,500","5,500","5,500","6,000","6,000","4,500","7,000","7,000"],
  "Замена микросхемы управления голосом": ["3,000","-","-","-","-","-","-","-","-","-","-","-"],
  "Замена аудиокодека": ["3,000","3,500","4,000","4,500","4,500","5,000","5,000","6,000","6,000","4,500","7,000","7,000"],
  "Замена микросхемы управления тачскрином": ["3,000","4,000","4,500","4,500","4,500","5,000","5,000","-","-","4,500","-","-"],
  "Замена микросхемы питания дисплея": ["-","-","4,000","4,500","4,500","5,500","5,500","5,500","5,500","4,500","6,000","6,000"],
  "Замена микросхемы подсветки дисплея": ["2,500","3,000","3,500","3,500","3,500","4,500","5,000","5,500","6,000","3,500","6,500","6,500"],
  "Замена гироскопа/акселлерометра/компаса": ["1,500","1,500","2,000","2,000","2,000","3,500","3,500","3,500","3,500","2,000","4,000","4,000"],
  "Замена усилителя нижнего динамика": ["2,000","2,000","2,500","3,500","2,500","4,500","4,500","5,000","5,000","2,500","5,500","5,500"],
  "Замена трансивера": ["3,000","4,000","4,000","4,500","4,000","5,500","5,500","6,000","6,000","6,000","7,500","7,500"],
  "Замена микросхемы вспышки": ["2,500","2,500","3,000","3,000","3,000","4,000","4,000","5,000","5,000","3,000","6,000","6,000"],
  "Замена усилителей GSM": ["1 500 - 2 000","2 500 - 3 500","2 500 - 3 500","3 000 - 4 000","3 000 - 4 000","3 500 - 4 500","3 500 - 4 500","4 000 - 5 000","4 000 - 5 000","4 000 - 5 000","5 500 - 6 500","5 500 - 6 500"],
  "Замена микросхемы питания модемной части": ["-","3,500","4,000","4,000","4,000","5,000","5,000","5,000","5,000","5,000","6,000","6,000"],
  "Реболлинг модемного процессора": ["3,500","4,000","4,000","4,000","4,000","5,000","5,000","5,500","5,500","5,500","8,000","8,000"], 
  "Реболлинг NAND Flash": ["3,500","3,500","3,500","3,500","3,500","4,000","4,000","4,500","4,500","4,500","5,000","5,000"],
  "Замена микросхемы питания Touch ID": ["-","-","-","-","3,500","4,500","4,500","5,000","5,000","3,500","6,000","6,000"],
  "Реболлинг NAND Flash": ["3,500","3,500","3,500","3,500","3,500","4,000","4,000","4,500","4,500","4,500","5,000","5,000"],
  "Замена микросхемы питания Touch ID": ["-","-","-","-","3,500","4,500","4,500","5,000","5,000","3,500","6,000","6,000"],
}




export default {
  components: {
    Modal
  },
  data () {
    return {
      showModal: false,
      iPhones: iPhones,
      Price: Price,
      active: 4
    }
  },
  methods: {
    jump(index) {
      this.active = index
    }
  }
}
</script>

<style lang="stylus">


$orange = #ff7849
$header = #3c4858










.BG

  background url('~assets/img/bg_3.jpg') no-repeat //center/80% fixed
  background-size: contain
  margin-bottom 3em
  //padding-left 50%

  min-height 800px
  // padding-bottom: 62%
  // background-size: contain //cover
  div
    margin auto 0 auto 50%
    background: rgba(#FFF .6);
    padding: 1em 0 1em 2em;
  p
    color #222
    font-size 1.2em
    background: #FFF
    padding .5em
</style>
