<template lang="pug">
  .flex_sb.intro
    div
      center
        svg(viewbox='0 0 128 128', height='128', width='128')
          path(d='M118.667,93.913,c-2.985,6.653-4.421,9.626-8.267,15.519c-5.364,8.226-12.928,18.469-22.309,18.545c-8.327,0.09-10.474-5.457-21.778-5.389    c-11.304,0.06-13.661,5.494-22.002,5.411c-9.374-0.083-16.541-9.325-21.905-17.551C7.399,87.463,5.82,60.481,15.074,46.128,c6.583-10.191,16.967-16.151,26.723-16.151c9.928,0,16.174,5.479,24.396,5.479c7.975,0,12.83-5.494,24.314-5.494,c8.693,0,17.903,4.764,24.456,12.983C93.477,54.791,96.956,85.656,118.667,93.913z M81.799,20.78,C85.974,15.391,89.138,7.775,87.994,0c-6.823,0.474-14.798,4.839-19.451,10.529c-4.242,5.155-7.728,12.825-6.367,20.268,C69.635,31.031,77.333,26.56,81.799,20.78z', fill='#A5B7CB')

        // любых устройств
        br
        br
        h1 Ремонт <b> Apple устройств </b> 
          br
          | в сервисном центре «MacBro»

        h5 Москва, м. Китай-город, ул. Покровка 3/7
        button.btn Заказать&nbsp;курьера
    .XXX
      //img(src="~assets/img/iphone6plus.png")
      .screen
        .from.end Вы ремонтируете iPhone ?
        .to.end Да. И не только. Мы восстанавливаем любые разбитые и утопленные устройства Apple. Занимаемся сложной пайкой плат.
        .from.end А цены ?
        .to Прайс «Ремонт TOP50» на сайте
        .to Если тяжёлый случай... Узнайте стоимость после диагностики. Это БЕСПЛАТНО!
        //Вообще... При сложном ремонте ваш аппарат может попасть к нам, даже если вы обратились куда-то ещё 😃.
        .to.end При сложном ремонте ваш аппарат может попасть к нам,  даже если вы обращались в другой сервис-центр 😃.


</template>

<script>
// import Logo from '~/components/Logo.vue'

// export default {
//   components: {
//     Logo
//   }
// }
</script>

<style lang="stylus">

.intro

  height: 100vh
  align-items: center

  // h1
  //   font-size: 2.8em
  // & > *
  //   flex 1

.XXX
  margin-left: 2em

  //314x640
  width: 314px
  height: 640px
  background url('../assets/img/iphone6plus.png') no-repeat
  position: relative

  .screen
    border: 2px solid #CCC
    border-radius: 4px
    position: absolute
    top: 72px;
    left: 23px;
    height: 495px;
    width: 268px;

    background: #FFF
    font-size: 13px
    font-weight: 600

    overflow: scroll



    & > *
      margin: 1em 1em 0
      border-radius: 1em
      background: #CCC
      padding: .7em 1em
      

    .from
      float left
      background: #E5E4E9
      color: #363636
    .to
      float right
      background: #2095FE
      color: #FFF
      margin-left: 2em 


</style>
